--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
do-- by @iq_100k
local function iq_100k(msg, matches)
if matches[1] == "الاوامر" then
local helps =  [[
<b>welcome in smilev4 </b>

<b>كليشه المعلومات المساعده</b> 💡
<b>
م1 ➖ لعرض اوامر القفل للمجموعه
م2 ➖ لعرض اوامر الرفع
م3 ➖ لعرض خواص البوت
→→→→⚙️SV4→→→→📚
S M I L E ➖ T E A M  

</b>
🌐 <b>Dev</b> ➣ @iq_100k
🌐 @Developer_Monster  
📚 <b>CH</b>➣ @porgramer2017
]]
reply_msg(msg.id, helps, ok_cb, false) 
end
if is_momod(msg) and matches[1]== 'م1' then
local g = [[
<b>welcome again in sv4 </b> 💎
<b>
مرحبا بك في اوامر القفل ل SV4🕴🏻

⚙️ قفل / فتح ➖ الروابط
⚙️ قفل / فتح ➖ اليوزر
⚙️ قفل / فتح ➖ التوجيه
⚙️ قفل / فتح ➖ التكرار
⚙️ قفل / فتح ➖ الملصقات
⚙️ قفل / فتح ➖ الكل
⚙️ قفل / افتح ➖ الدردشه
⚙️ قفل / افتح ➖ المجموعه
⚙️ قفل / افتح ➖ الصور
⚙️ قفل / افتح ➖ الفيديو
⚙️️ قفل / افتح ➖ الوسائط
⚙️ قفل / افتح ➖ الملفات
⚙️ قفل / افتح ➖ الصوت
⚙️ قفل / افتح ➖ المتحركه
⚙️️ قفل / افتح ➖ التفليش
⚙️️ قفل / افتح ➖ البوتات
⚙️️ قفل / افتح ➖ الجماعيه
⚙️️ قفل / افتح ➖ الاضافه
⚙️️ قفل / افتح ➖ الردود
⚙️️ قفل / افتح ➖ جهات الاتصال
⚙️️ المراقبه  ➖ نعم / لا
⚙️️ رد اضف + كلمه + الجمله
⚙️️ رد مسح + كلمه
⚙️️ الردود
⚙️️ مسح الردود
⚙️️ ضع تكرار + العدد
⚙️️ ضع وصف + الوصف
⚙️️ ضع قوانين + القوانين
⚙️️ ضع صوره
⚙️️ ضع اسم + اسم للمجموعه
⚙️️ كتم + معرف او بلرد
⚙️️ كتم + معرف ابو بلرد للمكتوم لالغاء كتمه
⚙️️ مسح الادمنيه
⚙️️ مسح بلرد لمسح الرد
⚙️️ مسح القوانين
⚙️️ مسح الوصق
⚙️️ سوبر لتحويل المجموعه الى سوبر

→→→→⚙️SV4→→→→📚
S M I L E ➖ T E A M  

</b>
🌐 Dev ➣ @iq_100k
🌐 @Developer_Monster 
📚 CH ➣ @porgramer2017
]]
reply_msg(msg.id, g, ok_cb, false) 
end
if is_momod(msg) and matches[1]== 'م2' then
local ds = [[
<b>اوامر الرفع للمجوعه </b> ⚙️
<b>
رفع المدير + معرف ➖ لرفع مدير للمجموعه
رفع ادمن + معرف ➖ لرفع ادمن للمجموعه
رفع مطور + الايدي ➖ لرفع مطور للبوت
تنزيل ادمن ➖ لتخفيض ادمن
تنزيل مطور +الايدي  ➖ لتخفيض المطور

→→→→⚙️SV4→→→📚
S M I L E ➖ T E A M  

</b>
🌐 Dev ➣ @iq_100k
🌐 ➣ @Developer_Monster
📚 CH ➣ @porgramer2017
]]
reply_msg(msg.id, ds, ok_cb, false) 
end

if is_momod(msg) and matches[1]== 'م3' then
local a = [[
<b>مرحبا بك في كليشه ⚙️ العامه</b>
<b>
1️⃣ لنشر منشور في جميع مجموعات البوت يرجى كتابه نشر او اذاعه والجمله المراد نشرها 💡

2️⃣ لحذف رد معين يرجى كتابه مسح بلرد للكلام الذي تود حذفه

3️⃣ لعرض ايديك يرجى كتابه ايديي

4️⃣ لرفع مدير للمجموعه يرجى كتابه رفع مدير + معرف 🚹

5️⃣ لرفع ادمن للمجموعه يرجى كتابه رفع ادمن بلرد او بلمعرف 📶

6️⃣ لتخفيض ادمن  يرجى كتابه تنزيل ادمن بلرد او بلمعرف 🌀

7️⃣ لاضافه قوانين يرجى كتابه اضافه قوانين + القوانين المراد وضعها ولعرض القوانين يرجى كتابه القوانين

8️⃣ لتفعيل او الغاء تفعيل ملف من داخل التلي يرجع كتابه تفعيل او تعطيل + اسم الملف بدون lua وسيتم تعطيله او تفعيله بنجاح 

9️⃣ لمعرفه موقعك في البوت اكتب موقعي

🔟 لمعرفك وقت مدينتك يرجى كتابه وقت او الوقت او التاريخ

1️⃣1️⃣ لتحديث السيرفر يرجى كتابه تحديث او تنشيط او اصلاح الاخطاء ولكل كلمه عملها الخاص بها 

2️⃣1️⃣ لتكرار كلمه معينه اكتب كول + الجمله المراد تكرارها 

3️⃣1️⃣ لمعرفه معلوماتك يرجى كتابه معلوماتي وسيتم عرضها

4️⃣1️⃣ لاضافه مطور يرجى كتابه رفع مطور + ايدي العضو ولتنزيل مطور يرجى كتابه تنزيل مطور والايدي الخاص بلمطور 


→→→→⚙️SV4→→→→📚
S M I L E ➖ T E A M  

</b>
🌐 Dev ➣ @iq_100k
🌐 ➣ @Developer_Monster
📚 CH ➣ @porgramer2017
]]
reply_msg(msg.id, a, ok_cb, false) 
end
  if not is_sudo(msg) and matches[1]== "م4" then
local su = "<b> for sudo only </b> 💡"
reply_msg(msg.id, e, ok_cb, false)
end
end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م1)$",
"^(م2)$",
"^(م3)$",
"^(الاوامر)$", 


},
run = iq_100k 
}
end
-- by @iq_100k
--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
