--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
do

function run(msg, matches)
  return [[ 
  <b> smile مرحبا بكم في سورس </b>
                                                    
⛵️ <b> v4 الاصدار </b>

🚁 <b> للتحدث مع مطورين السورس من هنا </b>

 🔺™ @iq_100k
➖ ™ @Developer_Monster 
 🔻™ @heelp_bot
 
⚠️ <b> السورس يدعم الربط على التوكن والرقم </b>
 
▫️➖▫️➖▫️➖▫️➖▫️➖▫️

📚<b>  تابع قناه السورس  </b>🏅

t.me/porgramer2017
]]
end

return {
  description = "", 
  usage = "!معلومات السورس:",
  patterns = {
    "^السورس$"

  }, 
  run = run 
}

end
--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
