--[[
       _               _                      _            _  ___   ___  _    
  __ _| |__   ___  ___| | ___ __ ___  _ __   (_) __ _     / |/ _ \ / _ \| | __
 / _` | '_ \ / _ \/ __| |/ / '__/ _ \| '_ \  | |/ _` |    | | | | | | | | |/ /
| (_| | |_) | (_) \__ \   <| | | (_) | |_) | | | (_| |    | | |_| | |_| |   < 
 \__,_|_.__/ \___/|___/_|\_\_|  \___/| .__/  |_|\__, |____|_|\___/ \___/|_|\_\
                                     |_|           |_|_____|
—]]
do 

function run(msg, matches) 
return "<b>👋 اهلا بك يا : "..msg.from.print_name.."\n\n </b>"
.."<b>"..os.date(" ¦ اليوم 📰 ¦ !%A, \n ¦ الشهر 📋 ¦ %B \n ¦ اليوم من الشهر 📊 ¦ %d,\n ¦ السنه 🗄 ¦ %Y</b>\n", timestamp)
end 

return { 
  description = "time", 
  patterns = { 
    "^الوقت", 
    "^وقت",
    "^التاريخ"
  }, 
  run = run 
} 

end 
